Revit 2027 API
BeamSystem.DropBeamSystem Method
Drop beam system, it will disassociate all members from the beam system and delete the beam system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void DropBeamSystem(
	BeamSystem beamSystem
)
Public Shared Sub DropBeamSystem (
	beamSystem As BeamSystem
)
public:
static void DropBeamSystem(
	BeamSystem^ beamSystem
)
static member DropBeamSystem :
        beamSystem : BeamSystem -> unit
Parameters
beamSystem BeamSystem
The beam system to be deleted.
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace